# !/usr/bin/env python3
# -*- coding:utf-8 -*-
# 灵璧县人民医院  志明  2019-05-25 9:52
# 当前计算机登录名称 :andy
# 项目名称  :andy
# 编译器   :PyCharm
__author____ = '志明'
__time__ = '2019-05-25 9:52'

if __name__ == '__main__':
    msg = '''
    MSH|^~\\&|LIS||HIS||20190525094600||OUL^R21|797746|P|2.4|||AL|AL|CHN\rMSA|AA||||F\r
    PID|||^^^^IDCard~342224194605220736^^^^IdentifyNO~^^^^Outpatient~201940709^^^^PatientNO||王计录|||M\r
    PV1||I|^^^203^眼科||||||5031^王佳慧||||||||||201940709|||||||||||||||||||||||||20190524151126\r
    OBR|1|1050310010380|119052460648|0681^血凝四项^Ordinary||20190525090455|||||||||0003&静脉血浆|||眼科|203|||20190525094600||||||||||0410|0858\r
    OBX|14062286|NM|FIB^纤维蛋白原||2.02|g/L|2--4|M|||F|||20190525094600\r
    OBX|14062284|NM|APTT^部分凝血酶原时间||24.00|秒|20--40|M|||F|||20190525094600\r
    OBX|14062282|NM|PT%^PT活动度||86.80|%|70--130|M|||F|||20190525094600\r
    OBX|14062283|NM|INR^国际标准化比值||1.01||0.94--1.3|M|||F|||20190525094600\r
    OBX|14062285|NM|TT^凝血酶时间||16.30|秒|14--20|M|||F|||20190525094600\r
    OBX|14062281|NM|PT^凝血酶原时间||11.60|秒|10--14|M|||F|||20190525094600\r
    NTE|1||\r
   '''
    # 去除换行符
    msg = msg.replace('\n    ', '')
    import hl7

    # 1,解析字符串得到hl7消息
    msg_hl7 = hl7.parse(line=msg, encoding='utf-8')
    # 判读消息类型
    print(type(msg_hl7))
    # 得到消息段数
    print('共有{0}个消息段,分别为{1}'.format(len(msg_hl7), [msg_hl7[i][0] for i in range(len(msg_hl7))]))
    # 得到消息段里面信息,若出现无法通过索引值获取可能是没有进行去换行符和空格
    print(msg_hl7['OBX'][0])
